#!/bin/bash

# shellcheck disable=SC2034

ips=(201.160.88.242 22.100.242.6 127.241.119.87 82.127.220.249 145.195.202.44 169.186.8.52 126.253.158.246 63.166.162.163 135.40.116.22 225.27.106.5)

codes=(
    200 # "Успешно". Запрос успешно обработан.
    200 #
    200 #
    200 #
    200 #
    200 #
    200 #
    200 #
    201 # Запрос успешно выполнен и в результате был создан ресурс
    400 # "Плохой запрос". Этот ответ означает, что сервер не понимает запрос из-за неверного синтаксиса.
    401 # "Неавторизованно". Для получения запрашиваемого ответа нужна аутентификация.
    403 # "Запрещено". У клиента нет прав доступа к содержимому, поэтому сервер отказывается дать надлежащий ответ.
    404 # "Не найден". Сервер не может найти запрашиваемый ресурс. 
    500 # "Внутренняя ошибка сервера". Сервер столкнулся с ситуацией, которую он не знает как обработать.
    501 # "Не реализовано". Метод запроса не поддерживается сервером и не может быть обработан.
    502 # Сервер, действуя в качестве шлюза или прокси, получил недопустимый ответ от сервера выше по иерархии или от другого вспомогательного сервера, который ему нужно было использовать для завершения запроса.
    503 # Сервер не готов обработать запрос. Общие причины включают отключение сервера для технического обслуживания, перегрузку или временные проблемы.
)

methods=(GET GET GET GET POST PUT PATCH DELETE)

urls=(
    /v1/data
    /research
    /user/repo
    /wiki/Main_Page
    /productID123
    /article123
    /location123
    /username123
)

agents=(
    Mozilla
    "Google Chrome"
    Opera
    Safari
    "Internet Explorer"
    "Microsoft Edge"
    "Crawler and bot"
    "Library and net tool"
)

sites=(
    "https://google.com"
    "https://youtube.com"
    "https://facebook.com"
    "https://amazon.com"
    "https://wikipedia.org"
)

days=(
    "2023-12-03"
    "2023-12-04"
    "2023-12-05"
    "2023-12-06"
    "2023-12-07"
)
